In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df1 = pd.read_csv('./data assig 2/AWCustomers.csv')
df2 = pd.read_csv('./data assig 2/AWSales.csv')
df3 = pd.read_csv('./data assig 2/AWTest-Classification.csv')
df4 = pd.read_csv('./data assig 2/AWTest-Regression.csv')

In [4]:
df1.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [5]:
df2.head()

   CustomerID  BikeBuyer  AvgMonthSpend
0       21173          1          50.97
1       13249          1          53.11
2       29350          1          54.08
3       13503          1          56.93
4       22803          1          55.41

In [6]:
df3.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,11219,NaN,Charles,NaN,Cook,NaN,6871 Bel Air Dr.,NaN,Woodburn,Oregon,...,High School,Skilled Manual,M,M,1,2,2,2,56100,2017-03-06
1,11241,NaN,Lisa,NaN,Cai,NaN,"102, rue de Berri",NaN,Les Ulis,Essonne,...,Partial College,Skilled Manual,F,S,1,0,0,0,61555,2017-03-06
2,11352,NaN,Raymond,A,Rodriguez,NaN,"24, impasse Ste-Madeleine",NaN,Pantin,Seine Saint Denis,...,Partial College,Clerical,M,M,1,3,0,2,83613,2017-03-06
3,11904,NaN,Kaylee,NaN,Cook,NaN,5742 Curtis Drive,NaN,Geelong,Victoria,...,Graduate Degree,Professional,F,S,1,2,0,0,130551,2017-03-06
4,11908,NaN,Rafael,A,Tang,NaN,8839 Leonard Dr,NaN,South Melbourne,Victoria,...,Graduate Degree,Professional,M,S,1,2,0,0,135915,2017-03-06

In [7]:
df4.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,11908,NaN,Rafael,A,Tang,NaN,8839 Leonard Dr,NaN,South Melbourne,Victoria,...,Graduate Degree,Professional,M,S,1,2,0,0,135915,2017-03-06
1,12286,NaN,Nathan,M,Jenkins,NaN,3093 Roland Drive,NaN,Peterborough,England,...,Graduate Degree,Professional,M,S,1,2,0,0,137732,2017-03-06
2,12892,NaN,Brian,NaN,Peterson,NaN,1284 Poppy Pl.,NaN,Royal Oak,British Columbia,...,Graduate Degree,Professional,M,M,1,2,0,0,135404,2017-03-06
3,14698,NaN,Diane,NaN,Navarro,NaN,Potsdamer StraÃŸe 92324,NaN,Frankfurt am Main,Saarland,...,Bachelors,Management,F,M,1,3,0,0,104040,2017-03-06
4,15085,NaN,Kristin,H,Jai,NaN,"88, impasse Notre-Dame",NaN,Morangis,Essonne,...,Graduate Degree,Professional,F,S,1,0,0,0,129319,2017-03-06

In [9]:
df1.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [10]:
df2.columns

Index(['CustomerID', 'BikeBuyer', 'AvgMonthSpend'], dtype='object')

In [11]:
df3.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [12]:
df4.columns

Index(['CustomerID', 'Title', 'FirstName', 'MiddleName', 'LastName', 'Suffix',
       'AddressLine1', 'AddressLine2', 'City', 'StateProvinceName',
       'CountryRegionName', 'PostalCode', 'PhoneNumber', 'BirthDate',
       'Education', 'Occupation', 'Gender', 'MaritalStatus', 'HomeOwnerFlag',
       'NumberCarsOwned', 'NumberChildrenAtHome', 'TotalChildren',
       'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [17]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            50 non-null     int64
 1   Title                 0 non-null      float64
 2   FirstName             50 non-null     object
 3   MiddleName            28 non-null     object
 4   LastName              50 non-null     object
 5   Suffix                0 non-null      float64
 6   AddressLine1          50 non-null     object
 7   AddressLine2          0 non-null      float64
 8   City                  50 non-null     object
 9   StateProvinceName     50 non-null     object
 10  CountryRegionName     50 non-null     object
 11  PostalCode            50 non-null     object
 12  PhoneNumber           50 non-null     object
 13  BirthDate             50 non-null     object
 14  Education             50 non-null     object
 15  Occupation            50 non-null     object
 16  Gender                50 non-null     object
 17  MaritalStatus         50 non-null     object
 18  HomeOwnerFlag         50 non-null     int64
 19  NumberCarsOwned       50 non-null     int64
 20  NumberChildrenAtHome  50 non-null     int64
 21  TotalChildren         50 non-null     int64
 22  YearlyIncome          50 non-null     int64
 23  LastUpdated           50 non-null     object
dtypes: float64(3), int64(6), object(15)
memory usage: 9.5+ KB

In [18]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            25 non-null     int64
 1   Title                 0 non-null      float64
 2   FirstName             25 non-null     object
 3   MiddleName            19 non-null     object
 4   LastName              25 non-null     object
 5   Suffix                0 non-null      float64
 6   AddressLine1          25 non-null     object
 7   AddressLine2          0 non-null      float64
 8   City                  25 non-null     object
 9   StateProvinceName     25 non-null     object
 10  CountryRegionName     25 non-null     object
 11  PostalCode            25 non-null     object
 12  PhoneNumber           25 non-null     object
 13  BirthDate             25 non-null     object
 14  Education             25 non-null     object
 15  Occupation            25 non-null     object
 16  Gender                25 non-null     object
 17  MaritalStatus         25 non-null     object
 18  HomeOwnerFlag         25 non-null     int64
 19  NumberCarsOwned       25 non-null     int64
 20  NumberChildrenAtHome  25 non-null     int64
 21  TotalChildren         25 non-null     int64
 22  YearlyIncome          25 non-null     int64
 23  LastUpdated           25 non-null     object
dtypes: float64(3), int64(6), object(15)
memory usage: 4.8+ KB

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18355 entries, 0 to 18354
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CustomerID     18355 non-null  int64
 1   BikeBuyer      18355 non-null  int64
 2   AvgMonthSpend  18355 non-null  float64
dtypes: float64(1), int64(2)
memory usage: 430.3 KB

In [21]:
df2['BikeBuyer'].unique()

array([1, 0])

In [22]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18361 entries, 0 to 18360
Data columns (total 24 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   Title                 101 non-null    object
 2   FirstName             18361 non-null  object
 3   MiddleName            10572 non-null  object
 4   LastName              18361 non-null  object
 5   Suffix                3 non-null      object
 6   AddressLine1          18361 non-null  object
 7   AddressLine2          311 non-null    object
 8   City                  18361 non-null  object
 9   StateProvinceName     18361 non-null  object
 10  CountryRegionName     18361 non-null  object
 11  PostalCode            18361 non-null  object
 12  PhoneNumber           18361 non-null  object
 13  BirthDate             18361 non-null  object
 14  Education             18361 non-null  object
 15  Occupation            18361 non-null  object
 16  Gender                18361 non-null  object
 17  MaritalStatus         18361 non-null  object
 18  HomeOwnerFlag         18361 non-null  int64
 19  NumberCarsOwned       18361 non-null  int64
 20  NumberChildrenAtHome  18361 non-null  int64
 21  TotalChildren         18361 non-null  int64
 22  YearlyIncome          18361 non-null  int64
 23  LastUpdated           18361 non-null  object
dtypes: int64(6), object(18)
memory usage: 3.4+ MB

> Merging the two df1 and df2 having same CustomerID

In [25]:
df = df2.merge(df1, left_on='CustomerID', right_on='CustomerID', how='left')

In [26]:
df.head()

,CustomerID,BikeBuyer,AvgMonthSpend,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,...,Education,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated
0,21173,1,50.97,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,...,Bachelors,Clerical,M,M,1,3,0,1,81916,2017-03-06
1,13249,1,53.11,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,...,Partial College,Clerical,M,M,1,2,1,2,81076,2017-03-06
2,29350,1,54.08,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,...,Bachelors,Clerical,F,S,0,3,0,0,86387,2017-03-06
3,13503,1,56.93,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,...,Partial College,Skilled Manual,M,M,1,2,1,2,61481,2017-03-06
4,22803,1,55.41,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,...,Partial College,Skilled Manual,M,S,1,1,0,0,51804,2017-03-06

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 26 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   FirstName             18361 non-null  object
 5   MiddleName            10572 non-null  object
 6   LastName              18361 non-null  object
 7   Suffix                3 non-null      object
 8   AddressLine1          18361 non-null  object
 9   AddressLine2          311 non-null    object
 10  City                  18361 non-null  object
 11  StateProvinceName     18361 non-null  object
 12  CountryRegionName     18361 non-null  object
 13  PostalCode            18361 non-null  object
 14  PhoneNumber           18361 non-null  object
 15  BirthDate             18361 non-null  object
 16  Education             18361 non-null  object
 17  Occupation            18361 non-null  object
 18  Gender                18361 non-null  object
 19  MaritalStatus         18361 non-null  object
 20  HomeOwnerFlag         18361 non-null  int64
 21  NumberCarsOwned       18361 non-null  int64
 22  NumberChildrenAtHome  18361 non-null  int64
 23  TotalChildren         18361 non-null  int64
 24  YearlyIncome          18361 non-null  int64
 25  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(18)
memory usage: 3.8+ MB

In [29]:
df.columns

Index(['CustomerID', 'BikeBuyer', 'AvgMonthSpend', 'Title', 'FirstName',
       'MiddleName', 'LastName', 'Suffix', 'AddressLine1', 'AddressLine2',
       'City', 'StateProvinceName', 'CountryRegionName', 'PostalCode',
       'PhoneNumber', 'BirthDate', 'Education', 'Occupation', 'Gender',
       'MaritalStatus', 'HomeOwnerFlag', 'NumberCarsOwned',
       'NumberChildrenAtHome', 'TotalChildren', 'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [32]:
df.corr()['BikeBuyer']

CustomerID             -0.021610
BikeBuyer               1.000000
AvgMonthSpend           0.280268
HomeOwnerFlag           0.229115
NumberCarsOwned         0.185078
NumberChildrenAtHome    0.359777
TotalChildren           0.209479
YearlyIncome            0.249457
Name: BikeBuyer, dtype: float64

In [34]:
len(df['Title'].unique()), len(df['FirstName'].unique()), len(df['MiddleName'].unique()), len(df['LastName'].unique())

(6, 670, 45, 375)

> It's clear that FirstName, MiddleName and LastName has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [36]:
df.drop(['FirstName', 'MiddleName', 'LastName'], axis=1, inplace=True)

In [37]:
len(df['Suffix'].unique()), len(df['AddressLine1'].unique()), len(df['AddressLine2'].unique()), len(df['City'].unique())

(2, 12742, 167, 269)

> It's clear that AddressLine1, AddressLine2 and City has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [38]:
df.drop(['City', 'AddressLine1', 'AddressLine2'], axis=1, inplace=True)

In [39]:
df.columns

Index(['CustomerID', 'BikeBuyer', 'AvgMonthSpend', 'Title', 'Suffix',
       'StateProvinceName', 'CountryRegionName', 'PostalCode', 'PhoneNumber',
       'BirthDate', 'Education', 'Occupation', 'Gender', 'MaritalStatus',
       'HomeOwnerFlag', 'NumberCarsOwned', 'NumberChildrenAtHome',
       'TotalChildren', 'YearlyIncome', 'LastUpdated'],
      dtype='object')

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   Suffix                3 non-null      object
 5   StateProvinceName     18361 non-null  object
 6   CountryRegionName     18361 non-null  object
 7   PostalCode            18361 non-null  object
 8   PhoneNumber           18361 non-null  object
 9   BirthDate             18361 non-null  object
 10  Education             18361 non-null  object
 11  Occupation            18361 non-null  object
 12  Gender                18361 non-null  object
 13  MaritalStatus         18361 non-null  object
 14  HomeOwnerFlag         18361 non-null  int64
 15  NumberCarsOwned       18361 non-null  int64
 16  NumberChildrenAtHome  18361 non-null  int64
 17  TotalChildren         18361 non-null  int64
 18  YearlyIncome          18361 non-null  int64
 19  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(12)
memory usage: 2.9+ MB

In [41]:
len(df['StateProvinceName'].unique()), len(df['CountryRegionName'].unique()), len(df['PostalCode'].unique()), len(df['PhoneNumber'].unique())

(54, 6, 323, 8836)

> It's clear that StateProvinceName, PostalCode and PhoneNumber has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [42]:
df.drop(['StateProvinceName', 'PostalCode', 'PhoneNumber'], axis=1, inplace=True)

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 17 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   Suffix                3 non-null      object
 5   CountryRegionName     18361 non-null  object
 6   BirthDate             18361 non-null  object
 7   Education             18361 non-null  object
 8   Occupation            18361 non-null  object
 9   Gender                18361 non-null  object
 10  MaritalStatus         18361 non-null  object
 11  HomeOwnerFlag         18361 non-null  int64
 12  NumberCarsOwned       18361 non-null  int64
 13  NumberChildrenAtHome  18361 non-null  int64
 14  TotalChildren         18361 non-null  int64
 15  YearlyIncome          18361 non-null  int64
 16  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(9)
memory usage: 2.5+ MB

In [44]:
len(df['BirthDate'].unique()), len(df['Education'].unique()), len(df['Occupation'].unique()), len(df['Gender'].unique())

(8230, 5, 5, 2)

In [45]:
len(df['MaritalStatus'].unique()), len(df['LastUpdated'].unique())

(2, 2)

> It's clear that BirthDate has to be removed due to high number of unique values in the Natural Language and cannot be hot line encoded

In [46]:
df.drop('BirthDate', axis=1, inplace=True)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   Title                 101 non-null    object
 4   Suffix                3 non-null      object
 5   CountryRegionName     18361 non-null  object
 6   Education             18361 non-null  object
 7   Occupation            18361 non-null  object
 8   Gender                18361 non-null  object
 9   MaritalStatus         18361 non-null  object
 10  HomeOwnerFlag         18361 non-null  int64
 11  NumberCarsOwned       18361 non-null  int64
 12  NumberChildrenAtHome  18361 non-null  int64
 13  TotalChildren         18361 non-null  int64
 14  YearlyIncome          18361 non-null  int64
 15  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(8)
memory usage: 2.4+ MB

> Title and Suffix has to be also dropped due to very low amount of data present.

In [48]:
df.drop(['Title', 'Suffix'], axis=1, inplace=True)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18361 entries, 0 to 18360
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerID            18361 non-null  int64
 1   BikeBuyer             18361 non-null  int64
 2   AvgMonthSpend         18361 non-null  float64
 3   CountryRegionName     18361 non-null  object
 4   Education             18361 non-null  object
 5   Occupation            18361 non-null  object
 6   Gender                18361 non-null  object
 7   MaritalStatus         18361 non-null  object
 8   HomeOwnerFlag         18361 non-null  int64
 9   NumberCarsOwned       18361 non-null  int64
 10  NumberChildrenAtHome  18361 non-null  int64
 11  TotalChildren         18361 non-null  int64
 12  YearlyIncome          18361 non-null  int64
 13  LastUpdated           18361 non-null  object
dtypes: float64(1), int64(7), object(6)
memory usage: 2.1+ MB